### terraform cicd
 #### Terraform Plan `success`

 <details><summary>Show Plan</summary>

 ```terraform
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.waf.aws_cloudwatch_log_group.waf_logs: Refreshing state... [id=aws-waf-logs-aws-study-tf-testlogs]
module.waf.aws_iam_role.this: Refreshing state... [id=aws-waf-logging-role]
module.rds.aws_iam_role.monitoring: Refreshing state... [id=rds-monitoring-role]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-04509b91d663e6701]
module.sns.aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:ap-northeast-1:605066737242:aws-study-tf-cloudwatch-alerts]
module.rds.aws_iam_role_policy_attachment.rds_monitoring_policy: Refreshing state... [id=rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.waf.aws_wafv2_web_acl.this: Refreshing state... [id=e5bad835-44f7-43f9-9e4c-2304a1fcf183]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-northeast-1]
module.waf.aws_iam_role_policy.this: Refreshing state... [id=aws-waf-logging-role:waf-logging-policy]
module.sns.aws_sns_topic_subscription.this: Refreshing state... [id=arn:aws:sns:ap-northeast-1:605066737242:aws-study-tf-cloudwatch-alerts:a969015b-c04d-490d-bc60-0623e1e7c51a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0931eb3280f4d83f6]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0375c69a8338223bd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a05abfc01ee0ee42]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-037506e4162ad75e8]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:targetgroup/aws-study-tf-tg/f1dfa26caec2b5fe]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07d5ee3fc9bdbebd0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08a4be58370f20f43]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a3dbaca44efa433e]
module.sg.aws_security_group.rds_sg: Refreshing state... [id=sg-09695283b5ba249b9]
module.sg.aws_security_group.alb_sg: Refreshing state... [id=sg-003462eaa88d3103f]
module.sg.aws_security_group.ec2_sg: Refreshing state... [id=sg-033646bf4202529c6]
module.waf.aws_wafv2_web_acl_logging_configuration.this: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:605066737242:regional/webacl/aws-study-tf-waf/e5bad835-44f7-43f9-9e4c-2304a1fcf183]
module.vpc.aws_db_subnet_group.this: Refreshing state... [id=aws-study-tf-db-subnetgroup]
module.vpc.aws_route_table_association.private_asso[1]: Refreshing state... [id=rtbassoc-0447f592bfaa7222a]
module.vpc.aws_route_table_association.private_asso[0]: Refreshing state... [id=rtbassoc-03f7e117a6841d7fe]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-040efd7cf8e18be94]
module.sg.aws_vpc_security_group_egress_rule.rds_ec2_sg: Refreshing state... [id=sgr-060a5bf836e70f1ef]
module.sg.aws_vpc_security_group_egress_rule.alb_public: Refreshing state... [id=sgr-09bc3cd8068cb2fc4]
module.sg.aws_vpc_security_group_egress_rule.public_outbound: Refreshing state... [id=sgr-0f2e0b697ee6eb469]
module.sg.aws_vpc_security_group_ingress_rule.public_alb: Refreshing state... [id=sgr-05d9da836431012c0]
module.sg.aws_vpc_security_group_ingress_rule.public: Refreshing state... [id=sgr-08dad5106fd54f46f]
module.sg.aws_vpc_security_group_ingress_rule.ec2_rds_sg: Refreshing state... [id=sgr-004ad18cbbbc034a7]
module.sg.aws_vpc_security_group_ingress_rule.public_ssh: Refreshing state... [id=sgr-09430b0acd3f1b287]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:loadbalancer/app/aws-study-tf-alb/f7b627c133a0f6dd]
module.vpc.aws_route_table_association.public_association[0]: Refreshing state... [id=rtbassoc-01d888d35517da422]
module.ec2.aws_instance.this: Refreshing state... [id=i-07c87efae44f67ef1]
module.vpc.aws_route_table_association.public_association[1]: Refreshing state... [id=rtbassoc-02cd831538e4ae976]
module.waf.aws_wafv2_web_acl_association.alb_asso: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:605066737242:regional/webacl/aws-study-tf-waf/e5bad835-44f7-43f9-9e4c-2304a1fcf183,arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:loadbalancer/app/aws-study-tf-alb/f7b627c133a0f6dd]
module.alb.aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:listener/app/aws-study-tf-alb/f7b627c133a0f6dd/bf730ecdc6b85729]
module.rds.aws_db_instance.this: Refreshing state... [id=db-6MDJTAMV42D3OL3D6H5ONWHFJE]
module.alb.aws_lb_target_group_attachment.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:targetgroup/aws-study-tf-tg/f1dfa26caec2b5fe-20250920005257363600000008]
module.cw.aws_cloudwatch_metric_alarm.main: Refreshing state... [id=aws-study-tf-high-cpu-utilization]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb.aws_lb.this has been deleted
  - resource "aws_lb" "this" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:loadbalancer/app/aws-study-tf-alb/f7b627c133a0f6dd" -> null
        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:loadbalancer/app/aws-study-tf-alb/f7b627c133a0f6dd"
      - load_balancer_type                                           = "application" -> null
        name                                                         = "aws-study-tf-alb"
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.this has been deleted
  - resource "aws_lb_listener" "this" {
        id                                                                  = "arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:listener/app/aws-study-tf-alb/f7b627c133a0f6dd/bf730ecdc6b85729"
      - port                                                                = 80 -> null
        # (17 unchanged attributes hidden)

      - default_action {
          - type             = "forward" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.sg.aws_security_group.ec2_sg has changed
  ~ resource "aws_security_group" "ec2_sg" {
        id                     = "sg-033646bf4202529c6"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "111.189.136.62/32",
                ]
              - description      = "Allow SSH My Adress"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "1.115.59.205/32",
                ]
              + description      = "Allow SSH My Adress"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "145.132.102.51/32",
                  + "172.178.119.118/32",
                  + "52.242.243.97/32",
                  + "52.176.125.114/32",
                  + "52.159.245.153/32",
                  + "52.154.130.209/32",
                  + "64.236.153.81/32",
                  + "135.232.177.199/32",
                  + "132.196.82.139/32",
                  + "52.176.35.118/32",
                  + "128.24.160.232/32",
                  + "52.161.51.150/32",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
        name                   = "terraform-20250920005225070800000002"
        tags                   = {
            "Name" = "aws-study-tf-ec2-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.sg.aws_vpc_security_group_ingress_rule.public_ssh has changed
  ~ resource "aws_vpc_security_group_ingress_rule" "public_ssh" {
      ~ cidr_ipv4              = "111.189.136.62/32" -> "1.115.59.205/32"
        id                     = "sgr-09430b0acd3f1b287"
        # (9 unchanged attributes hidden)
    }

  # module.sns.aws_sns_topic_subscription.this has been deleted
  - resource "aws_sns_topic_subscription" "this" {
        id                              = "arn:aws:sns:ap-northeast-1:605066737242:aws-study-tf-cloudwatch-alerts:a969015b-c04d-490d-bc60-0623e1e7c51a"
      - protocol                        = "email" -> null
        # (16 unchanged attributes hidden)
    }

  # module.waf.aws_wafv2_web_acl.this has been deleted
  - resource "aws_wafv2_web_acl" "this" {
      - arn                         = "arn:aws:wafv2:ap-northeast-1:605066737242:regional/webacl/aws-study-tf-waf/e5bad835-44f7-43f9-9e4c-2304a1fcf183" -> null
        id                          = "e5bad835-44f7-43f9-9e4c-2304a1fcf183"
        name                        = "aws-study-tf-waf"
      - scope                       = "REGIONAL" -> null
        # (7 unchanged attributes hidden)

      - rule {
          - name     = "common-ruleset" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWS-AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }

      - visibility_config {
          - cloudwatch_metrics_enabled = true -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "aws-study-tf-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "ap-northeast-1"
      + security_groups                                              = [
          + "sg-003462eaa88d3103f",
        ]
      + subnets                                                      = [
          + "subnet-0375c69a8338223bd",
          + "subnet-0a05abfc01ee0ee42",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.this will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "ap-northeast-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:605066737242:targetgroup/aws-study-tf-tg/f1dfa26caec2b5fe"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.sg.aws_vpc_security_group_ingress_rule.public_ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "public_ssh" {
      ~ cidr_ipv4              = "1.115.59.205/32" -> "111.189.136.62/32"
        id                     = "sgr-09430b0acd3f1b287"
        # (9 unchanged attributes hidden)
    }

  # module.sns.aws_sns_topic_subscription.this will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "orixbaffaloes@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + region                          = "ap-northeast-1"
      + topic_arn                       = "arn:aws:sns:ap-northeast-1:605066737242:aws-study-tf-cloudwatch-alerts"
    }

  # module.waf.aws_wafv2_web_acl.this will be created
  + resource "aws_wafv2_web_acl" "this" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF for ALB"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "aws-study-tf-waf"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + scope                       = "REGIONAL"
      + tags_all                    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "common-ruleset"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWS-AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "aws-study-tf-waf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf.aws_wafv2_web_acl_association.alb_asso will be created
  + resource "aws_wafv2_web_acl_association" "alb_asso" {
      + id           = (known after apply)
      + region       = "ap-northeast-1"
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # module.waf.aws_wafv2_web_acl_logging_configuration.this will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "this" {
      + id                      = (known after apply)
      + log_destination_configs = [
          + "arn:aws:logs:ap-northeast-1:605066737242:log-group:aws-waf-logs-aws-study-tf-testlogs",
        ]
      + region                  = "ap-northeast-1"
      + resource_arn            = (known after apply)

      + logging_filter {
          + default_behavior = "KEEP"

          + filter {
              + behavior    = "DROP"
              + requirement = "MEETS_ALL"

              + condition {
                  + action_condition {
                      + action = "ALLOW"
                    }
                }
            }
          + filter {
              + behavior    = "KEEP"
              + requirement = "MEETS_ANY"

              + condition {
                  + action_condition {
                      + action = "BLOCK"
                    }
                }
            }
        }

      + redacted_fields {
          + single_header {
              + name = "authorization"
            }
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

 </details>